POMIN-163/TI_CUP_2021/source/ti/boards/MSP432E411Y_BGAEVM/MSP432E411Y_BGAEVM.c
const SDFatFS_Config SDFatFS_config[MSP432E411Y_BGAEVM_SDFatFSCOUNT] = {
    {
        .object = &sdfatfsObjects[MSP432E411Y_BGAEVM_SDFatFS0]
    }
};

const uint_least8_t SDFatFS_count = MSP432E411Y_BGAEVM_SDFatFSCOUNT;

/*
 *  =============================== SD ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/sd/SDSPI.h>

SDSPI_Object sdspiObjects[MSP432E411Y_BGAEVM_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[MSP432E411Y_BGAEVM_SDCOUNT] = {
    {
        .spiIndex = MSP432E411Y_BGAEVM_SPI2,
        .spiCsGpioIndex = MSP432E411Y_BGAEVM_SDSPI_CS
    }
};

const SD_Config SD_config[MSP432E411Y_BGAEVM_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[MSP432E411Y_BGAEVM_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[MSP432E411Y_BGAEVM_SDSPI0]
    },
};

const uint_least8_t SD_count = MSP432E411Y_BGAEVM_SDCOUNT;

/*
 *  =============================== SPI ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPIMSP432E4DMA.h>

SPIMSP432E4DMA_Object spiMSP432E4DMAObjects[MSP432E411Y_BGAEVM_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to
 * (~0) to satisfy the SDSPI driver requirement.
 */
const SPIMSP432E4DMA_HWAttrs spiMSP432E4DMAHWAttrs[MSP432E411Y_BGAEVM_SPICOUNT] = {
    {
        .baseAddr = SSI2_BASE,
        .intNum = INT_SSI2,
        .intPriority = (~0),
        .defaultTxBufValue = (~0),
        .rxDmaChannel = UDMA_CH12_SSI2RX,
        .txDmaChannel = UDMA_CH13_SSI2TX,
        .minDmaTransferSize = 10,
        .clkPinMask = SPIMSP432E4_PD3_SSI2CLK,
        .fssPinMask = SPIMSP432E4_PD2_SSI2FSS,
        .xdat0PinMask = SPIMSP432E4_PD1_SSI2XDAT0,
        .xdat1PinMask = SPIMSP432E4_PD0_SSI2XDAT1
    },
    {
        .baseAddr = SSI3_BASE,
        .intNum = INT_SSI3,
        .intPriority = (~0),
        .defaultTxBufValue = (~0),
        .minDmaTransferSize = 10,
        .rxDmaChannel = UDMA_CH14_SSI3RX,
        .txDmaChannel = UDMA_CH15_SSI3TX,
        .clkPinMask = SPIMSP432E4_PQ0_SSI3CLK,
        .fssPinMask = SPIMSP432E4_PQ1_SSI3FSS,
        .xdat0PinMask = SPIMSP432E4_PQ2_SSI3XDAT0,
        .xdat1PinMask = SPIMSP432E4_PQ3_SSI3XDAT1
    }
};

const SPI_Config SPI_config[MSP432E411Y_BGAEVM_SPICOUNT] = {
    {
        .fxnTablePtr = &SPIMSP432E4DMA_fxnTable,
        .object = &spiMSP432E4DMAObjects[MSP432E411Y_BGAEVM_SPI2],
        .hwAttrs = &spiMSP432E4DMAHWAttrs[MSP432E411Y_BGAEVM_SPI2]
    },
    {
        .fxnTablePtr = &SPIMSP432E4DMA_fxnTable,
        .object = &spiMSP432E4DMAObjects[MSP432E411Y_BGAEVM_SPI3],
        .hwAttrs = &spiMSP432E4DMAHWAttrs[MSP432E411Y_BGAEVM_SPI3]
    },
};

const uint_least8_t SPI_count = MSP432E411Y_BGAEVM_SPICOUNT;

/*
 *  =============================== Timer ===============================
 */
#include <ti/drivers/Timer.h>
#include <ti/drivers/timer/TimerMSP432E4.h>

TimerMSP432E4_Object timerMSP432E4Objects[MSP432E411Y_BGAEVM_TIMERCOUNT];

const TimerMSP432E4_HWAttrs timerMSP432E4HWAttrs[MSP432E411Y_BGAEVM_TIMERCOUNT] = {
    {
        .baseAddress = TIMER2_BASE,
        .subTimer = TimerMSP432E4_timer32,
        .intNum = INT_TIMER2A,
        .intPriority = ~0
    },
    {
        .baseAddress = TIMER1_BASE,
        .subTimer = TimerMSP432E4_timer16A,
        .intNum = INT_TIMER1A,
        .intPriority = ~0
    },
    {
         .baseAddress = TIMER1_BASE,
         .subTimer = TimerMSP432E4_timer16B,
         .intNum = INT_TIMER1B,
         .intPriority = ~0
    },
};

const Timer_Config Timer_config[MSP432E411Y_BGAEVM_TIMERCOUNT] = {
    {
        .fxnTablePtr = &TimerMSP432E4_fxnTable,
        .object = &timerMSP432E4Objects[MSP432E411Y_BGAEVM_TIMER0],
        .hwAttrs = &timerMSP432E4HWAttrs[MSP432E411Y_BGAEVM_TIMER0]
    },
    {
        .fxnTablePtr = &TimerMSP432E4_fxnTable,
        .object = &timerMSP432E4Objects[MSP432E411Y_BGAEVM_TIMER1],
        .hwAttrs = &timerMSP432E4HWAttrs[MSP432E411Y_BGAEVM_TIMER1]
    },
    {
        .fxnTablePtr = &TimerMSP432E4_fxnTable,
        .object = &timerMSP432E4Objects[MSP432E411Y_BGAEVM_TIMER2],
        .hwAttrs = &timerMSP432E4HWAttrs[MSP432E411Y_BGAEVM_TIMER2]
    },
};

const uint_least8_t Timer_count = MSP432E411Y_BGAEVM_TIMERCOUNT;

/*
 *  =============================== UART ===============================
 */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTMSP432E4.h>

UARTMSP432E4_Object uartMSP432E4Objects[MSP432E411Y_BGAEVM_UARTCOUNT];
unsigned char uartMSP432E4RingBuffer[MSP432E411Y_BGAEVM_UARTCOUNT][32];

/* UART configuration structure */
const UARTMSP432E4_HWAttrs uartMSP432E4HWAttrs[MSP432E411Y_BGAEVM_UARTCOUNT] = {
    {
        .baseAddr = UART0_BASE,
        .intNum = INT_UART0,
        .intPriority = (~0),
        .flowControl = UARTMSP432E4_FLOWCTRL_NONE,
        .ringBufPtr  = uartMSP432E4RingBuffer[MSP432E411Y_BGAEVM_UART0],
        .ringBufSize = sizeof(uartMSP432E4RingBuffer[MSP432E411Y_BGAEVM_UART0]),
        .rxPin = UARTMSP432E4_PA0_U0RX,
        .txPin = UARTMSP432E4_PA1_U0TX,
        .ctsPin = UARTMSP432E4_PIN_UNASSIGNED,
        .rtsPin = UARTMSP432E4_PIN_UNASSIGNED,
        .errorFxn = NULL
    }
};

const UART_Config UART_config[MSP432E411Y_BGAEVM_UARTCOUNT] = {
    {
        .fxnTablePtr = &UARTMSP432E4_fxnTable,
        .object = &uartMSP432E4Objects[MSP432E411Y_BGAEVM_UART0],
        .hwAttrs = &uartMSP432E4HWAttrs[MSP432E411Y_BGAEVM_UART0]
    }
};

const uint_least8_t UART_count = MSP432E411Y_BGAEVM_UARTCOUNT;

/*
 *  =============================== Watchdog ===============================
 */
#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogMSP432E4.h>

WatchdogMSP432E4_Object watchdogMSP432E4Objects[MSP432E411Y_BGAEVM_WATCHDOGCOUNT];

const WatchdogMSP432E4_HWAttrs watchdogMSP432E4HWAttrs[MSP432E411Y_BGAEVM_WATCHDOGCOUNT] = {
    {
        .baseAddr = WATCHDOG0_BASE,
        .intNum = INT_WATCHDOG,
        .intPriority = (~0),
        .reloadValue = 80000000 /* 1 second period at default CPU clock freq */
    },
};

const Watchdog_Config Watchdog_config[MSP432E411Y_BGAEVM_WATCHDOGCOUNT] = {
    {
        .fxnTablePtr = &WatchdogMSP432E4_fxnTable,
        .object = &watchdogMSP432E4Objects[MSP432E411Y_BGAEVM_WATCHDOG0],
        .hwAttrs = &watchdogMSP432E4HWAttrs[MSP432E411Y_BGAEVM_WATCHDOG0]
    },
};

const uint_least8_t Watchdog_count = MSP432E411Y_BGAEVM_WATCHDOGCOUNT;
